In [ ]:
import numpy as np
import pandas as pd

s = pd.Series([1,3,5,np.nan,6,8])
s

In [ ]:
s.index

In [ ]:
s.values

In [ ]:
index_seq = range(10,20)
seq_data = range(10)

s2 = pd.Series(data=seq_data, index=index_seq) 

s2

In [ ]:
s1 = pd.Series(range(10,80,10))
dict_date = {
    '국어' : 100,
    '영어' : 95,
    '수학' : 80
}

s5 = pd.Series(dict_date)
s5

In [ ]:
s1= pd.Series(range(10, 70, 10))
s2 = pd.Series(range(5))

s1 // s2

In [ ]:
a = pd.date_range('2019-05-25', '2019-05-31')
a

In [ ]:
a = pd.date_range('2019-05-25', periods = 4)
a

In [ ]:
a = pd.date_range('2019-05-25 10:00:00', periods=6)
a

In [ ]:
date_index1 = pd.date_range('2019-05-25' , periods=4)
date_index2 = pd.date_range('2019.05.25' , periods=4)
date_index3 = pd.date_range('2019/05/25' , periods=4)
print('date_index1: ', repr(date_index1))
print('date_index2: ', repr(date_index2))
print('date_index3: ', repr(date_index3))

In [4]:
import pandas as pd
date_index1 = pd.date_range('2019-05-25' , periods=8, freq ='Q')
date_index1

DatetimeIndex(['2019-06-30', '2019-09-30', '2019-12-31', '2020-03-31',
               '2020-06-30', '2020-09-30', '2020-12-31', '2021-03-31'],
              dtype='datetime64[ns]', freq='Q-DEC')

# Head and Tail

In [12]:
import numpy as np
import pandas as pd

data = np.linspace(0, 149, 150).reshape(50,3).astype(int)
df = pd.DataFrame(data)
df.head()
df.tail()

      0    1    2
45  135  136  137
46  138  139  140
47  141  142  143
48  144  145  146
49  147  148  149

In [18]:
df1 = pd.DataFrame({'봄': [256.5, 265.3, 273.2, 211.3],
                    '여름': [264.5, 234.3, 273.2, 234.3],
                    '가을': [232.5, 222.3, 297.2, 263.3],
                    '봄겨울': [211.5, 213.3, 271.2, 281.3]
                   })
df1

       봄     여름     가을    봄겨울
0  256.5  264.5  232.5  211.5
1  265.3  234.3  222.3  213.3
2  273.2  273.2  297.2  271.2
3  211.3  234.3  263.3  281.3

In [19]:

df1.sum()

봄      1006.3
여름     1006.3
가을     1015.3
봄겨울     977.3
dtype: float64

In [20]:
df1.mean()

봄      251.575
여름     251.575
가을     253.825
봄겨울    244.325
dtype: float64

In [22]:
df1.mean(axis = 1) #가로로 계산

0    241.25
1    233.80
2    278.70
3    247.55
dtype: float64

In [24]:
df1.describe()

                봄         여름         가을         봄겨울
count    4.000000    4.00000    4.00000    4.000000
mean   251.575000  251.57500  253.82500  244.325000
std     27.702873   20.26119   33.76264   37.100977
min    211.300000  234.30000  222.30000  211.500000
25%    245.200000  234.30000  229.95000  212.850000
50%    260.900000  249.40000  247.90000  242.250000
75%    267.275000  266.67500  271.77500  273.725000
max    273.200000  273.20000  297.20000  281.300000

In [26]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
봄      4 non-null float64
여름     4 non-null float64
가을     4 non-null float64
봄겨울    4 non-null float64
dtypes: float64(4)
memory usage: 208.0 bytes

In [28]:
df1['여름']

0    264.5
1    234.3
2    273.2
3    234.3
Name: 여름, dtype: float64

In [31]:
df1[:3]

       봄     여름     가을    봄겨울
0  256.5  264.5  232.5  211.5
1  265.3  234.3  222.3  213.3
2  273.2  273.2  297.2  271.2

In [36]:
df1.loc[0:4]

       봄     여름     가을    봄겨울
0  256.5  264.5  232.5  211.5
1  265.3  234.3  222.3  213.3
2  273.2  273.2  297.2  271.2
3  211.3  234.3  263.3  281.3

# 결합

In [39]:
df1['봄'][: 2]

0    256.5
1    265.3
Name: 봄, dtype: float64

In [44]:
df1.loc[0:, '봄':'가을']

       봄     여름     가을
0  256.5  264.5  232.5
1  265.3  234.3  222.3
2  273.2  273.2  297.2
3  211.3  234.3  263.3

In [46]:
import random
month_list = [str(i) + '월' for i in range(1,5)]


df_a_b = pd.DataFrame({'판매월': month_list,
                       '제품C': prod_c,
                       '제품D': prod_d})
df_a_b

df_a_b.merge(df_C_D)

NameError: name 'prod_c' is not defined

In [47]:
prod_E, prod_f = [np.random.randint(50, 100, size=4) for i in range(5)]

df_E_F = pd.DataFrame({'판매월': month_list,
                       '제품C': prod_E,
                       '제품D': prod_F})

ValueError: too many values to unpack (expected 2)